---
type: TextNote
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# TextNote

`Autodesk.Revit.DB.TextNote` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddLeader | — | `public Leader AddLeader ( TextNoteLeaderTypes leaderType )` |
| Method | Create | — | `` |
| Method | GetFormattedText | 2017 | `public FormattedText GetFormattedText ()` |
| Method | GetLeaders | 2016 | `public IList < Leader > GetLeaders ()` |
| Method | RemoveLeaders | — | `public void RemoveLeaders ()` |
| Method | SetFormattedText | 2017 | `public void SetFormattedText ( FormattedText formattedText )` |
| Property | LeaderCount | 2016 | `public int LeaderCount { get ; }` |
| Property | LeaderLeftAttachment | 2016 | `public LeaderAtachement LeaderLeftAttachment { get ; set ; }` |
| Property | LeaderRightAttachment | 2016 | `public LeaderAtachement LeaderRightAttachment { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | TextNoteType | — | `public TextNoteType TextNoteType { get ; set ; }` |